#Напишите программу, которая выполняет следующие математические преобразования:
import math
none=None
str_1="STROKA"*3
str_2=str(none)+"123"
print("str_2:",str_2)
